; domain
(define (domain spy_mission)
  (:requirements :strips :typing)

  (:types
    person
    gear
    location
    victim
  )

  (:predicates
    ;;
    (group-formed)

    ;;
    (member-of-group ?p - person)

    ;;
    (has-gear ?p - person ?g - gear)

    ;;
    (location-set ?l - location)

    ;;
    (victim-identified ?v - victim)
  )

  ;;   1：
  (:action form_spy_group
    :parameters (?p1 - person ?p2 - person ?p3 - person)
    :precondition (and
                    (not (group-formed))
                    (member-of-group ?p1)
                    (member-of-group ?p2)
                    (member-of-group ?p3))
    :effect (group-formed)
  )

  ;;   2：
  (:action set_location
    :parameters (?l - location)
    :precondition (and
                    (group-formed)
                    (not (location-set ?l)))
    :effect (location-set ?l)
  )

  ;;   3：
  (:action gather_gear
    :parameters (?p - person ?g - gear)
    :precondition (and
                    (group-formed)
                    (location-set safehouse)
                    (not (has-gear ?p ?g)))
    :effect (has-gear ?p ?g)
  )

  ;;   4：
  (:action identify_victim
    :parameters (?v - victim)
    :precondition (not (victim-identified ?v))
    :effect (victim-identified ?v)
  )
)

; problem
(define (problem spy_mission_problem)
  (:domain spy_mission)

  (:objects
    ;;
    you co_conspirator1 co_conspirator2 - person

    ;;
    binoculars camera - gear

    ;;
    safehouse - location

    ;;
    target_victim - victim
  )

  (:init
    ;;     ：           ，
    (member-of-group you)
    (member-of-group co_conspirator1)
    (member-of-group co_conspirator2)

    ;;     ：     ，     ，
    ;;         ，       :init
  )

  (:goal
    (and
      ;;
      (group-formed)

      ;;
      (location-set safehouse)

      ;;
      (has-gear you binoculars)
      (has-gear you camera)
      (has-gear co_conspirator1 binoculars)
      (has-gear co_conspirator1 camera)
      (has-gear co_conspirator2 binoculars)
      (has-gear co_conspirator2 camera)

      ;;
      (victim-identified target_victim)
    )
  )
)

; plan
1. (form_spy_group co_conspirator1 co_conspirator1 co_conspirator1)
   added: (group-formed)
   goals met: 1 of 9
2. (set_location safehouse)
   added: (location-set safehouse)
   goals met: 2 of 9
3. (identify_victim target_victim)
   added: (victim-identified target_victim)
   goals met: 3 of 9
4. (gather_gear you camera)
   added: (has-gear you camera)
   goals met: 4 of 9
5. (gather_gear you binoculars)
   added: (has-gear you binoculars)
   goals met: 5 of 9
6. (gather_gear co_conspirator2 camera)
   added: (has-gear co_conspirator2 camera)
   goals met: 6 of 9
7. (gather_gear co_conspirator2 binoculars)
   added: (has-gear co_conspirator2 binoculars)
   goals met: 7 of 9
8. (gather_gear co_conspirator1 camera)
   added: (has-gear co_conspirator1 camera)
   goals met: 8 of 9
9. (gather_gear co_conspirator1 binoculars)
   added: (has-gear co_conspirator1 binoculars)
   goals met: 9 of 9
